# Pandas

In [1]:
"""
4 types of libreries in python

NumPy---> Data Manipulation(Matrix)
Pandas---> Data Processing, Cleaning, Manipulation
SeaBorn & Matplotlib---> Data Visualization

We will do---> Data Analysis, Data Cleaning, Data Processing, Data Visualization
"""

'\n4 types of libreries in python\n\nNumPy---> Data Manipulation(Matrix)\nPandas---> Data Processing, Cleaning, Manipulation\nSeaBorn & Matplotlib---> Data Visualization\n\nWe will do---> Data Analysis, Data Cleaning, Data Processing, Data Visualization\n'

In [2]:
import pandas as pd
dict1={'Name':['A','B','C','D'], 'Age':[2,4,6,8]}
df=pd.DataFrame(dict1)
df.head()

  Name  Age
0    A    2
1    B    4
2    C    6
3    D    8

In [3]:
df['Birthday']=[3,5,7,8]
df

  Name  Age  Birthday
0    A    2         3
1    B    4         5
2    C    6         7
3    D    8         8

In [4]:
import pandas as pd
dict1={'Name':['E'], 'Age':[10]}
df_new=pd.DataFrame(dict1)

In [5]:
df_new

  Name  Age
0    E   10

In [6]:
df

  Name  Age  Birthday
0    A    2         3
1    B    4         5
2    C    6         7
3    D    8         8

In [7]:
df.describe()

            Age  Birthday
count  4.000000  4.000000
mean   5.000000  5.750000
std    2.581989  2.217356
min    2.000000  3.000000
25%    3.500000  4.500000
50%    5.000000  6.000000
75%    6.500000  7.250000
max    8.000000  8.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   Age       4 non-null      int64
 2   Birthday  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [9]:
df.loc[[0],['Name']]

  Name
0    A

In [10]:
df.loc[[2],['Name']]

  Name
2    C

In [11]:
df.loc[[1],['Name']]='K'
df

  Name  Age  Birthday
0    A    2         3
1    K    4         5
2    C    6         7
3    D    8         8

In [12]:
df.iloc[1,1]

4

In [13]:
df.iloc[1,2]=100

In [14]:
df

  Name  Age  Birthday
0    A    2         3
1    K    4       100
2    C    6         7
3    D    8         8

In [15]:
df.to_csv('Demo.csv')

In [16]:
df_read=pd.read_csv('Demo.csv')
df_read

   Unnamed: 0 Name  Age  Birthday
0           0    A    2         3
1           1    K    4       100
2           2    C    6         7
3           3    D    8         8

In [17]:
df_read=df_read.drop(['Unnamed: 0'], axis=1)
df_read

  Name  Age  Birthday
0    A    2         3
1    K    4       100
2    C    6         7
3    D    8         8

In [18]:
left_df=pd.DataFrame({'Key':['A', 'B', 'C', 'D'], 'Left_Value':[1,2,3,4]})
right_df=pd.DataFrame({'Key':['B', 'D', 'G', 'H'], 'Right_Value':[5,6,7,8]})

In [19]:
left_df

  Key  Left_Value
0   A           1
1   B           2
2   C           3
3   D           4

In [20]:
right_df

  Key  Right_Value
0   B            5
1   D            6
2   G            7
3   H            8

In [21]:
merge_df=pd.merge(left_df,right_df,on='Key')
merge_df

  Key  Left_Value  Right_Value
0   B           2            5
1   D           4            6

In [22]:
merge1_df=pd.merge(left_df,right_df,on='Key', how='outer')
merge1_df

  Key  Left_Value  Right_Value
0   A         1.0          NaN
1   B         2.0          5.0
2   C         3.0          NaN
3   D         4.0          6.0
4   G         NaN          7.0
5   H         NaN          8.0